In [3]:
import pandas as pd 

caminho = './Arquivos/bank-full.xlsx'

df = pd.read_excel (caminho,sheet_name='Sheet 1 - bank-full')

df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown

In [6]:
df['education'].value_counts()

education
secondary    23202
tertiary     13301
primary       6851
unknown       1857
Name: count, dtype: int64

## Calculando Média e Soma

In [9]:
# pd.mean () >> Calcular a média 
# pd.sum () >> Calcular a soma de uma coluna
# pd.max () >> Identifica o maior valor de uma coluna
# pd.min () >> Identifica o menor valor de uma coluna
# pd.count () >> Contar a quantidade de registros de uma coluna 

df.balance.mean()

1362.2720576850766

In [11]:
df.duration.mean()

258.1630797814691

In [13]:
df[['balance','duration']].mean()

balance     1362.272058
duration     258.163080
dtype: float64

In [15]:
# Listar os elementos únicos de uma coluna 
# Remove as duplicadas e retorna os elementos únicos 

df.job.unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [17]:
# Este comando retorna a quantidade de elementos únicos existentes e uma coluna.

df.job.nunique()

12

### Dados duplicados

In [20]:
# Calculas a quantidade de registros duplicados em uma tabela 

df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
45206    False
45207    False
45208    False
45209    False
45210    False
Length: 45211, dtype: bool

In [24]:
# Calcular a quantidade de registros duplicados em uma coluna

df.job.duplicated().sum()

45199

In [28]:
# Exibir quais linhas são duplicadas 

df[df.job.duplicated() == True]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
5,35,management,married,tertiary,no,231,yes,no,unknown,5,may,139,1,-1,0,unknown
6,28,management,single,tertiary,no,447,yes,yes,unknown,5,may,217,1,-1,0,unknown
7,42,entrepreneur,divorced,tertiary,yes,2,yes,no,unknown,5,may,380,1,-1,0,unknown
9,43,technician,single,secondary,no,593,yes,no,unknown,5,may,55,1,-1,0,unknown
11,29,admin.,single,secondary,no,390,yes,no,unknown,5,may,137,1,-1,0,unknown
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45206,51,technician,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown
45207,71,retired,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown
45208,72,retired,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown
45210,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other